In [31]:
import pandas as pd

In [32]:
data = [1, 2, 3, 4, 5]

In [33]:
data

[1, 2, 3, 4, 5]

In [34]:
type(data)

list

In [35]:
# make series form the list
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
type(s)

pandas.core.series.Series

In [37]:
df1 = pd.DataFrame(data, columns=["ID"])
df1

   ID
0   1
1   2
2   3
3   4
4   5

In [38]:
s2 = df1['ID']
s2

0    1
1    2
2    3
3    4
4    5
Name: ID, dtype: int64

In [39]:
data = [[1,2], [3, 4], [5, 6]]
data

[[1, 2], [3, 4], [5, 6]]

In [40]:
df = pd.DataFrame(data, columns=['ID', 'Roll'])
df

   ID  Roll
0   1     2
1   3     4
2   5     6

In [41]:
s = df[['ID', 'Roll']]
print(s)

   ID  Roll
0   1     2
1   3     4
2   5     6

In [42]:
data = {
    'Name':['Tom', 'nick', 'krish', 'jack'],
    'Age':[20, 21, 19, 18],
    'Address':['USA', 'UK', 'CAN', 'AUS']
}
data

{'Name': ['Tom', 'nick', 'krish', 'jack'],
 'Age': [20, 21, 19, 18],
 'Address': ['USA', 'UK', 'CAN', 'AUS']}

In [43]:
s = pd.Series(data)
s

Name       [Tom, nick, krish, jack]
Age                [20, 21, 19, 18]
Address         [USA, UK, CAN, AUS]
dtype: object

In [44]:
df = pd.DataFrame(data)
df

    Name  Age Address
0    Tom   20     USA
1   nick   21      UK
2  krish   19     CAN
3   jack   18     AUS

In [45]:
age_series = df['Age']
age

NameError: name 'age' is not defined

In [ ]:
# Set to Series and DataFrame
s1 = {1,2,3,4,5}
type(s1)

In [46]:
s = pd.Series(list(s1)) # first convert list
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [47]:
df = pd.DataFrame(s1)
df

   0
0  1
1  2
2  3
3  4
4  5

In [48]:
# Tuple to Series and DataFrame
t = (1,2,3,4,5,6, True, False)
s = pd.Series(t)
s

0        1
1        2
2        3
3        4
4        5
5        6
6     True
7    False
dtype: object

In [49]:
df = pd.DataFrame(t)
df

       0
0      1
1      2
2      3
3      4
4      5
5      6
6   True
7  False

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       8 non-null      object
dtypes: object(1)
memory usage: 196.0+ bytes